# 市场
MARKET_SZ = 0  # 深市
MARKET_SH = 1  # 沪市
MARKET_BJ = 2  # 北交

# K线种类
# 0 -   5 分钟K 线
KLINE_5MIN = 0
# 1 -   15 分钟K 线
KLINE_15MIN = 1
# 2 -   30 分钟K 线
KLINE_30MIN = 2
# 3 -   1 小时K 线
KLINE_1HOUR = 3
# 4 -   日K 线
KLINE_DAILY = 4
# 5 -   周K 线
KLINE_WEEKLY = 5
# 6 -   月K 线
KLINE_MONTHLY = 6
# 7 -   扩展市场 1 分钟
KLINE_EX_1MIN = 7
# 8 -   1 分钟K 线
KLINE_1MIN = 8
# 9 -   日K 线
KLINE_RI_K = 9
# 10 -  季K 线
KLINE_3MONTH = 10
# 11 -  年K 线
KLINE_YEARLY = 11

# 分笔行情最多2000条
MAX_TRANSACTION_COUNT = 2000

# K线数据最多800条
MAX_KLINE_COUNT = 800

FREQUENCY = ['5m', '15m', '30m', '1h', 'day', 'week', 'mon', 'ex_1m', '1m', 'dk', '3mon', 'year']

# 板块相关参数
BLOCK_SZ = 'block_zs.dat'
BLOCK_FG = 'block_fg.dat'
BLOCK_GN = 'block_gn.dat'
BLOCK_DEFAULT = 'block.dat'

TYPE_FLATS = 0
TYPE_GROUP = 1

HQ_HOSTS = [
    ('探活验证 123.125.108.101', '123.125.108.101', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 123.125.108.103', '123.125.108.103', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('海通', '123.125.108.90', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 101.42.240.54', '101.42.240.54', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 101.43.159.194', '101.43.159.194', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 82.156.174.84', '82.156.174.84', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 202.108.254.67', '202.108.254.67', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 101.42.164.241', '101.42.164.241', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 82.156.214.79', '82.156.214.79', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 49.232.15.141', '49.232.15.141', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 62.234.50.143', '62.234.50.143', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 120.53.8.251', '120.53.8.251', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 81.70.151.186', '81.70.151.186', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 39.105.251.234', '39.105.251.234', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 183.242.231.6', '183.242.231.6', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 8.160.37.6', '8.160.37.6', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 183.201.231.84', '183.201.231.84', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('上证云北京联通一', '123.125.108.14', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 221.0.195.48', '221.0.195.48', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 111.15.15.43', '111.15.15.43', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 152.136.191.169', '152.136.191.169', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 182.118.8.4', '182.118.8.4', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('海通', '182.118.47.151', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('华林', '218.106.92.182', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('华林', '218.106.92.183', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('华林', '220.178.55.86', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 42.177.92.37', '42.177.92.37', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 182.118.8.9', '182.118.8.9', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 114.141.177.40', '114.141.177.40', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 114.141.177.118', '114.141.177.118', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 114.141.177.44', '114.141.177.44', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('杭州联通主站J2', '60.12.136.250', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 58.34.106.207', '58.34.106.207', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 116.128.207.164', '116.128.207.164', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 120.253.221.207', '120.253.221.207', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 124.223.163.242', '124.223.163.242', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 120.199.2.123', '120.199.2.123', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 123.60.47.136', '123.60.47.136', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 111.229.247.189', '111.229.247.189', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 117.149.2.68', '117.149.2.68', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 117.149.2.70', '117.149.2.70', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 150.158.160.2', '150.158.160.2', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 118.25.98.114', '118.25.98.114', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 120.199.2.122', '120.199.2.122', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 101.35.121.35', '101.35.121.35', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 111.231.113.208', '111.231.113.208', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('广发', '119.29.19.242', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 110.41.2.72', '110.41.2.72', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 27.151.2.37', '27.151.2.37', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('广发', '183.60.224.178', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 43.139.18.171', '43.139.18.171', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 81.71.32.47', '81.71.32.47', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 122.51.232.182', '122.51.232.182', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('广发', '183.60.224.177', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 39.108.28.83', '39.108.28.83', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 43.139.95.83', '43.139.95.83', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 45.116.35.251', '45.116.35.251', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 210.21.65.136', '210.21.65.136', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 58.67.221.146', '58.67.221.146', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('海通', '182.131.3.245', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 111.230.186.52', '111.230.186.52', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 175.178.128.227', '175.178.128.227', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 183.131.224.21', '183.131.224.21', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 120.196.72.45', '120.196.72.45', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 183.131.224.27', '183.131.224.27', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('杭州电信主站J4', '115.238.90.165', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 121.37.207.165', '121.37.207.165', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 159.75.29.111', '159.75.29.111', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 219.146.254.27', '219.146.254.27', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 129.204.230.128', '129.204.230.128', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 101.33.225.16', '101.33.225.16', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 123.88.147.5', '123.88.147.5', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 122.51.120.217', '122.51.120.217', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 175.178.112.197', '175.178.112.197', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('华林', '220.178.55.71', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('杭州电信主站J2', '115.238.56.198', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('杭州电信主站J3', '218.75.126.9', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('海通', '175.6.5.153', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 123.60.164.122', '123.60.164.122', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('海通', '58.63.254.217', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('上证云成都电信一', '218.6.170.47', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('杭州电信主站J1', '60.191.117.167', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('安信', '59.36.5.11', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 218.17.146.5', '218.17.146.5', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 121.33.228.164', '121.33.228.164', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 101.52.238.101', '101.52.238.101', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('海通', '58.63.254.191', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 27.151.2.38', '27.151.2.38', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 202.100.166.12', '202.100.166.12', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('海通', '202.100.166.27', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 121.36.248.138', '121.36.248.138', 7709),  # 2026-09-30 alphaquant 探活验证(无第三握手包)
    ('探活验证 111.203.134.118', '111.203.134.118', 7709),  # 2026-09-30 alphaquant 探活验证
    ('探活验证 117.133.128.226', '117.133.128.226', 7709),  # 2026-09-30 alphaquant 探活验证
    ('国泰君安', '117.34.114.17', 7709),  # 2026-09-30 alphaquant 探活验证
    ('国泰君安', '117.34.114.20', 7709),  # 2026-09-30 alphaquant 探活验证
    ('国泰君安', '117.34.114.18', 7709),  # 2026-09-30 alphaquant 探活验证
    ('国泰君安', '117.34.114.13', 7709),  # 2026-09-30 alphaquant 探活验证
    ('国泰君安', '117.34.114.15', 7709),  # 2026-09-30 alphaquant 探活验证
    ('国泰君安', '117.34.114.27', 7709),  # 2026-09-30 alphaquant 探活验证
    ('国泰君安', '117.34.114.14', 7709),  # 2026-09-30 alphaquant 探活验证
    ('国泰君安', '117.34.114.16', 7709),  # 2026-09-30 alphaquant 探活验证
    ('探活验证 1.202.143.37', '1.202.143.37', 7709),  # 2026-09-30 alphaquant 探活验证
    ('上海行情主站1', '180.153.18.170', 7709),
    ('深圳行情主站1', '119.147.212.81', 7709),
    ('上海行情主站2', '101.227.73.20', 7709),
    ('深圳双线主站1', '110.41.147.114', 7709),
    ('深圳双线主站2', '8.129.13.54', 7709),
    ('深圳双线主站3', '120.24.149.49', 7709),
    ('深圳双线主站4', '47.113.94.204', 7709),
    ('深圳双线主站5', '8.129.174.169', 7709),
    ('深圳双线主站6', '110.41.154.219', 7709),
    ('上海双线主站1', '124.70.176.52', 7709),
    ('上海双线主站2', '47.100.236.28', 7709),
    ('上海双线主站3', '101.133.214.242', 7709),
    ('上海双线主站4', '47.116.21.80', 7709),
    ('上海双线主站5', '47.116.105.28', 7709),
    ('上海双线主站6', '124.70.199.56', 7709),
    ('北京双线主站1', '121.36.54.217', 7709),
    ('北京双线主站2', '121.36.81.195', 7709),
    ('北京双线主站3', '123.249.15.60', 7709),
    ('广州双线主站1', '124.71.85.110', 7709),
    ('广州双线主站2', '139.9.51.18', 7709),
    ('广州双线主站3', '139.159.239.163', 7709),
    ('上海双线主站7', '106.14.201.131', 7709),
    ('上海双线主站8', '106.14.190.242', 7709),
    ('上海双线主站9', '121.36.225.169', 7709),
    ('上海双线主站10', '123.60.70.228', 7709),
    ('上海双线主站11', '123.60.73.44', 7709),
    ('上海双线主站12', '124.70.133.119', 7709),
    ('上海双线主站13', '124.71.187.72', 7709),
    ('上海双线主站14', '124.71.187.122', 7709),
    ('武汉电信主站1', '119.97.185.59', 7709),
    ('深圳双线主站7', '47.107.64.168', 7709),
    ('北京双线主站4', '124.70.75.113', 7709),
    ('广州双线主站4', '124.71.9.153', 7709),
    ('上海双线主站15', '123.60.84.66', 7709),
    ('深圳双线主站8', '47.107.228.47', 7719),
    ('北京双线主站5', '120.46.186.223', 7709),
    ('北京双线主站6', '124.70.22.210', 7709),
    ('北京双线主站7', '139.9.133.247', 7709),
    ('广州双线主站5', '116.205.163.254', 7709),
    ('广州双线主站6', '116.205.171.132', 7709),
    ('广州双线主站7', '116.205.183.150', 7709)
]

EX_HOSTS = [
    # ('扩展市场深圳双线1', '112.74.214.43', 7727),
    # ('扩展市场深圳双线2', '120.24.0.77', 7727),
    # ('扩展市场深圳双线3', '47.107.75.159', 7727),
    # ('扩展市场武汉主站1', '119.97.185.5', 7727),
    # ('扩展市场武汉主站2', '202.103.36.71', 7727),
    # ('扩展市场武汉主站3', '59.175.238.38', 7727),
    # ('扩展市场北京双线0', '47.92.127.181', 7727),
    # ('扩展市场上海双线0', '106.14.95.149', 7727),
    # ('扩展市场新加双线0', '119.23.127.172', 7727),
    ('银河阿里云扩展行情', '47.112.95.207', 7720),
    ('银河杭州电信扩展行情', '218.75.75.18', 7720),
    ('银河武汉电信扩展行情', '58.49.110.76', 7720),
]

GP_HOSTS = [
    ('默认财务数据线路', '120.76.152.87', 7709),
]

CONFIG = {
    'SERVER': {'HQ': HQ_HOSTS, 'EX': EX_HOSTS, 'GP': GP_HOSTS},
    'BESTIP': {'HQ': '', 'EX': '', 'GP': ''},
    'TDXDIR': 'C:/new_tdx',
}


def return_last_value(retry_state):
    """return the result of the last call attempt"""
    return retry_state.outcome.result()
